//1. 스폰
const spawnData = { name: "스폰 지점", mcX: -969, mcZ: -965 };

//2. 십이지신
const animals = [
    { order: 1, name: "쥐", mcX: -2900, mcY: 127, mcZ: -4600 },
    { order: 2, name: "소", mcX: -616, mcY: 116, mcZ: 3889 },
    { order: 3, name: "호랑이", mcX: -5500, mcY: 152, mcZ: -1600 },
    { order: 4, name: "토끼", mcX: 4590, mcY: 122, mcZ: -3397 },
    { order: 5, name: "용", mcX: -891, mcY: 106, mcZ: -536 },
    { order: 6, name: "뱀", mcX: 2685, mcY: 145, mcZ: -4051 },
    { order: 7, name: "말", mcX: -2365, mcY: 282, mcZ: 3968 },
    { order: 8, name: "양", mcX: 5093, mcY: 135, mcZ: 2092 },
    { order: 9, name: "원숭이", mcX: 3280, mcY: 162, mcZ: 2952 },
    { order: 10, name: "닭", mcX: 5075, mcY: 106, mcZ: -344 },
    { order: 11, name: "개", mcX: -4455, mcY: 171, mcZ: -2376 },
    { order: 12, name: "돼지", mcX: -3657, mcY: 212, mcZ: 1112 }
];

//3. 광산
const mines = [
    { n: 1, x: -1093, y: 89, z: -701, c: "녹" }, { n: 2, x: -1038, y: 68, z: -14, c: "녹" },
    { n: 3, x: -1837, y: 64, z: -944, c: "녹" }, { n: 4, x: -2599, y: 71, z: -2691, c: "녹" },
    { n: 5, x: -4001, y: 84, z: -1579, c: "녹" }, { n: 6, x: 1085, y: 227, z: 199, c: "녹" },
    { n: 7, x: -775, y: 92, z: -1986, c: "녹" }, { n: 8, x: 2605, y: 81, z: -1142, c: "녹" },
    { n: 9, x: 752, y: 147, z: -1272, c: "녹" }, { n: 10, x: -4322, y: 88, z: -2810, c: "청" },
    { n: 11, x: 815, y: 25, z: 2558, c: "황" }, { n: 12, x: -1913, y: 104, z: 3153, c: "황" },
    { n: 13, x: -3094, y: 24, z: 855, c: "황" }, { n: 14, x: 7137, y: 63, z: -1668, c: "청" },
    { n: 15, x: 6123, y: 95, z: 486, c: "청" }, { n: 16, x: 5709, y: 65, z: -3342, c: "청" },
    { n: 17, x: 3806, y: 75, z: 5436, c: "적" }, { n: 18, x: 3542, y: 74, z: 6378, c: "적" },
    { n: 19, x: -6250, y: 85, z: 2367, c: "적" }, { n: 20, x: -7547, y: 86, z: 623, c: "적" },
    { n: 21, x: -2854, y: 103, z: -5529, c: "청" }, { n: 22, x: -5186, y: 71, z: 1256, c: "청" },
    { n: 23, x: 4301, y: 110, z: -3381, c: "녹" }, { n: 24, x: 5584, y: 78, z: 3322, c: "청" },
    { n: 25, x: 1998, y: 205, z: 4657, c: "적" }, { n: 26, x: 2201, y: 99, z: -2740, c: "녹" },
    { n: 27, x: -6540, y: 79, z: 516, c: "적" }, { n: 28, x: 3701, y: 79, z: 2080, c: "황" },
    { n: 29, x: -4084, y: 70, z: 3035, c: "황" }, { n: 30, x: 6217, y: 89, z: 4562, c: "적" },
    { n: 31, x: -563, y: 74, z: -6176, c: "녹" }, { n: 32, x: 1472, y: 82, z: -6472, c: "녹" },
    { n: 33, x: 4214, y: 74, z: -4596, c: "녹" }, { n: 34, x: 1941, y: 72, z: -5632, c: "녹" },
    { n: 35, x: -4657, y: 71, z: -4523, c: "청" }, { n: 36, x: -4830, y: 74, z: -4303, c: "청" },
    { n: 37, x: -5480, y: 100, z: -1720, c: "청" }, { n: 38, x: -6696, y: 88, z: -1145, c: "적" },
    { n: 39, x: -559, y: 73, z: -4593, c: "녹" }, { n: 40, x: 1487, y: 70, z: 5300, c: "적" },
    { n: 41, x: 1601, y: 78, z: 5485, c: "적" }, { n: 42, x: 2129, y: 74, z: 6598, c: "적" },
    { n: 43, x: -960, y: 82, z: 2033, c: "황" }, { n: 44, x: -2468, y: 195, z: 4433, c: "황" },
    { n: 45, x: -5443, y: 73, z: 4139, c: "적" }, { n: 46, x: 4024, y: 209, z: 3356, c: "적" },
    { n: 47, x: 658, y: 74, z: 3900, c: "황" }, { n: 48, x: -2121, y: 83, z: -3837, c: "녹" },
    { n: 49, x: 4886, y: 89, z: 954, c: "청" }, { n: 50, x: 4942, y: 76, z: -1189, c: "청" },
    { n: 51, x: 677, y: 235, z: 1433, c: "황" }, { n: 52, x: -762, y: 213, z: -6601, c: "녹" },
    { n: 53, x: 2657, y: 75, z: -5891, c: "녹" }, { n: 54, x: 2036, y: 72, z: -3624, c: "녹" },
    { n: 55, x: -4098, y: 75, z: -55, c: "청" }, { n: 56, x: -2006, y: 77, z: 127, c: "녹" },
    { n: 57, x: -2264, y: 81, z: -1571, c: "녹" }, { n: 58, x: 3885, y: 104, z: -1415, c: "녹" },
    { n: 59, x: -5054, y: 80, z: -2598, c: "청" }, { n: 60, x: 3323, y: 67, z: 3939, c: "적" },
    { n: 61, x: 5258, y: 79, z: 5723, c: "적" }, { n: 62, x: 1014, y: 84, z: -2648, c: "녹" },
    { n: 63, x: 2705, y: 80, z: 2461, c: "황" }, { n: 64, x: -4029, y: 134, z: 2321, c: "황" },
    { n: 65, x: -790, y: 109, z: 4284, c: "황" }
];

const mineResources = {
    "녹": "갈옥, 신선옥, 정철광, 청연광, 일옥",
    "청": "청강석, 현철, 한철, 빙옥, 만년한철",
    "황": "오철, 금강석, 정철광",
    "적": "매화옥, 묵철, 혹옥, 청연광, 용린광",
    "공통": "돌덩어리, 철광석, 적동석, 광산초"
};

// 광산별 동선 순서 (데이터 보관용)
const minePaths = {
    "녹": [33, 23, 58, 8, 26, 54, 62, 9, 6, 2, 1, 3, 57, 4, 48, 39, 31, 52, 32, 34, 53, 7, 56, 5],
    "청": [22, 55, 59, 37, 10, 36, 35, 21, 16, 14, 15, 49, 50, 24],
    "황": [29, 64, 13, 43, 12, 44, 65, 47, 11, 51, 63, 28],
    "적": [41, 40, 25, 60, 46, 17, 18, 42, 61, 30, 45, 19, 27, 20, 38]
};

const redItems = [
    { n: 1, x: -3656, y: 78, z: 4060, file: "red1.png" },
    { n: 2, x: -1458, y: 94, z: 2875, file: "red2.png" },
    { n: 3, x: 2358, y: 100, z: 2177, file: "red3.png" },
    { n: 4, x: 2661, y: 72, z: -4790, file: "red4.png" },
    { n: 5, x: 1961, y: 150, z: -6200, file: "red5.png" },
    { n: 6, x: -2579, y: 87, z: -5970, file: "red6.png" },
    { n: 7, x: -3375, y: 100, z: 3449, file: "red7.png" }
];

// 동상 데이터 (이미지 포함)
const statues = [
    { name: "한월동상", x: -334, y: 255, z: -5519, file: "statue2.png" },
    { name: "제천대성", x: 1513, y: 260, z: 3615, file: "statue3.png" },
    { name: "UNKNOWN", x: 2903, y: 243, z: 714, file: "statue1.png" }
];

// 비석 데이터 (아이콘만)
const mountains = [
    { name: "천보산", x: -2030, y: 80, z: -4142 },
    { name: "망운산", x: -2662, y: 80, z: -1556 },
    { name: "봉래산", x: -5278, y: 80, z: -2042 },
    { name: "신운산", x: -2984, y: 80, z: 72 },
    { name: "월랑산", x: -2720, y: 80, z: 2883 },
    { name: "사성산", x: 4356, y: 80, z: 3515 },
    { name: "용문산", x: 5378, y: 80, z: 3731 },
    { name: "삼악산", x: 5917, y: 80, z: 2453 },
    { name: "도덕산", x: 6498, y: 80, z: 67 },
    { name: "청태산(탁본퀘스트)", x: 4191, y: 80, z: -2806 }
];

// 탐색 데이터
const potItems = [
    { name: "항아리", x: -713, y: 156, z: 2862, item: "고목조각", tool: "탐색부적" },
    { name: "항아리", x: -1758, y: 243, z: -838, item: "송진덩어리", tool: "탐색부적" },
    { name: "항아리", x: 2179, y: 117, z: -529, item: "향목가루", tool: "탐령구" },
    { name: "항아리", x: 5878, y: 154, z: 1155, item: "깨진옥조각", tool: "탐색부적" },
    { name: "항아리", x: -5333, y: 155, z: 673, item: "깨진기와", tool: "탐색부적" },
    { name: "항아리", x: -3784, y: 125, z: -1670, item: "낡은목간", tool: "탐색부적" },
    { name: "항아리", x: -3313, y: 123, z: 3169, item: "청동파편", tool: "탐령구" },
    { name: "항아리", x: 720, y: 150, z: 1800, item: "녹슨철패", tool: "탐령구" },
    { name: "항아리", x: 6426, y: 112, z: 2392, item: "연마사", tool: "탐령구" },
    { name: "항아리", x: -7368, y: 88, z: 1546, item: "잔존영석", tool: "탐령구" },
    { name: "항아리", x: 7268, y: 65, z: 5300, item: "봉인된철편", tool: "탐령구" },
    { name: "항아리", x: 4171, y: 74, z: 2643, item: "마모된인장", tool: "탐령구" }
];

// 의문의 상자 데이터
const mysteryBoxes = [
    { name: "의문의 상자", x: -4818, y: 85, z: -3812, item: "일반부적뽑기" },
    { name: "의문의 상자", x: -6523, y: 76, z: 2194, item: "일반부적뽑기", entrance: "x:-6518 y:89 z:2366" },
    { name: "의문의 상자", x: -6761, y: 91, z: 846, item: "고급주문서뽑기" },
    { name: "의문의 상자", x: -3317, y: 122, z: -4255, item: "일반부적뽑기" },
    { name: "의문의 상자", x: 3068, y: 172, z: 6312 },
    { name: "의문의 상자", x: -4395, y: 134, z: 5670 },
    { name: "의문의 상자", x: 5107, y: 211, z: -1998 },
    { name: "의문의 상자", x: 2985, y: 179, z: -980 },
    { name: "의문의 상자", x: -1420, y: 128, z: -4655 },
    { name: "의문의 상자", x: 2984, y: 181, z: -975 },
    { name: "의문의 상자", x: -1852, y: 143, z: 4290 },
    { name: "의문의 상자", x: 7049, y: 142, z: 2874, item: "고급주문서뽑기" },
    { name: "의문의 상자", x: 1124, y: 258, z: 1498, item: "일반부적뽑기"},
    { name: "의문의 상자", x: -3979, y: 80, z: 2501 }
];
